; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v6 ?v12)
             (pred_5 ?v1 ?v9)
             (pred_9 ?v6 ?v9)
             (pred_7 ?v5 ?v6 )
	     (pred_10 ?v6)
             (pred_12 ?v13)
             (pred_2 ?v1)
             (pred_3 ?v9)
             (pred_11 ?v6)
             (pred_6 ?v1)
             (pred_1 ?v6)
             (pred_8 ))



(:action op_3
:parameters (?v7 ?v4 ?v8 ?v2)
:precondition (and (pred_12 ?v7) (pred_12 ?v4) (pred_2 ?v8) (pred_3 ?v2)
          (pred_4 ?v7 ?v4) (pred_5 ?v8 ?v2)
                   (pred_9 ?v4 ?v2) (pred_10 ?v7) 
                   (pred_11 ?v4) (pred_6 ?v8))
:effect (and  (pred_1 ?v4) (not (pred_11 ?v4))))


(:action op_5
:parameters (?v7 ?v3)
:precondition (and (pred_12 ?v7) (pred_12 ?v3)
               (pred_10 ?v7) (pred_4 ?v7 ?v3) (pred_1 ?v3))
:effect (and (pred_10 ?v3) (not (pred_10 ?v7))))

(:action op_2
:parameters (?v7 ?v8)
:precondition (and (pred_12 ?v7) (pred_2 ?v8) 
                  (pred_10 ?v7) (pred_7 ?v8 ?v7) (pred_8 ))
:effect (and (pred_6 ?v8)
   (not (pred_7 ?v8 ?v7)) (not (pred_8 ))))


(:action op_4
:parameters (?v7 ?v11 ?v10)
:precondition (and (pred_12 ?v7) (pred_2 ?v11) (pred_2 ?v10)
                  (pred_10 ?v7) (pred_6 ?v10) (pred_7 ?v11 ?v7))
:effect (and (pred_6 ?v11) (pred_7 ?v10 ?v7)
        (not (pred_6 ?v10)) (not (pred_7 ?v11 ?v7))))

(:action op_1
:parameters (?v7 ?v8)
:precondition (and (pred_12 ?v7) (pred_2 ?v8) 
                  (pred_10 ?v7) (pred_6 ?v8))
:effect (and (pred_8 ) (pred_7 ?v8 ?v7) (not (pred_6 ?v8)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_20 obj_24 obj_01 obj_23 obj_18 obj_13 obj_16 obj_08 obj_30 obj_09 obj_02 obj_15 obj_04 obj_27 obj_28 obj_14 obj_21 obj_07 obj_31 obj_05 obj_19 obj_26 obj_12 obj_10
    obj_25 obj_03 obj_17
    obj_06 obj_22 obj_29
    )

    (:init
       (pred_8)

       (pred_12 obj_11)
       (pred_12 obj_20)
       (pred_12 obj_24)
       (pred_12 obj_01)
       (pred_12 obj_23)
       (pred_12 obj_18)
       (pred_12 obj_13)
       (pred_12 obj_16)
       (pred_12 obj_08)
       (pred_12 obj_30)
       (pred_12 obj_09)
       (pred_12 obj_02)
       (pred_12 obj_15)
       (pred_12 obj_04)
       (pred_12 obj_27)
       (pred_12 obj_28)
       (pred_12 obj_14)
       (pred_12 obj_21)
       (pred_12 obj_07)
       (pred_12 obj_31)
       (pred_12 obj_05)
       (pred_12 obj_19)
       (pred_12 obj_26)
       (pred_12 obj_12)
       (pred_12 obj_10)
       (pred_3 obj_25)
       (pred_3 obj_03)
       (pred_3 obj_17)
       (pred_2 obj_06)
       (pred_2 obj_22)
       (pred_2 obj_29)

       (pred_4 obj_11 obj_18)
       (pred_4 obj_11 obj_20)
       (pred_4 obj_20 obj_13)
       (pred_4 obj_20 obj_24)
       (pred_4 obj_20 obj_11)
       (pred_4 obj_24 obj_16)
       (pred_4 obj_24 obj_01)
       (pred_4 obj_24 obj_20)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_01 obj_23)
       (pred_4 obj_01 obj_24)
       (pred_4 obj_23 obj_30)
       (pred_4 obj_23 obj_01)
       (pred_4 obj_18 obj_09)
       (pred_4 obj_18 obj_13)
       (pred_4 obj_18 obj_11)
       (pred_4 obj_13 obj_02)
       (pred_4 obj_13 obj_16)
       (pred_4 obj_13 obj_20)
       (pred_4 obj_13 obj_18)
       (pred_4 obj_16 obj_15)
       (pred_4 obj_16 obj_08)
       (pred_4 obj_16 obj_24)
       (pred_4 obj_16 obj_13)
       (pred_4 obj_08 obj_04)
       (pred_4 obj_08 obj_30)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_08 obj_16)
       (pred_4 obj_30 obj_27)
       (pred_4 obj_30 obj_23)
       (pred_4 obj_30 obj_08)
       (pred_4 obj_09 obj_28)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_09 obj_18)
       (pred_4 obj_02 obj_14)
       (pred_4 obj_02 obj_15)
       (pred_4 obj_02 obj_13)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_15 obj_21)
       (pred_4 obj_15 obj_04)
       (pred_4 obj_15 obj_16)
       (pred_4 obj_15 obj_02)
       (pred_4 obj_04 obj_07)
       (pred_4 obj_04 obj_27)
       (pred_4 obj_04 obj_08)
       (pred_4 obj_04 obj_15)
       (pred_4 obj_27 obj_31)
       (pred_4 obj_27 obj_30)
       (pred_4 obj_27 obj_04)
       (pred_4 obj_28 obj_05)
       (pred_4 obj_28 obj_14)
       (pred_4 obj_28 obj_09)
       (pred_4 obj_14 obj_19)
       (pred_4 obj_14 obj_21)
       (pred_4 obj_14 obj_02)
       (pred_4 obj_14 obj_28)
       (pred_4 obj_21 obj_26)
       (pred_4 obj_21 obj_07)
       (pred_4 obj_21 obj_15)
       (pred_4 obj_21 obj_14)
       (pred_4 obj_07 obj_12)
       (pred_4 obj_07 obj_31)
       (pred_4 obj_07 obj_04)
       (pred_4 obj_07 obj_21)
       (pred_4 obj_31 obj_10)
       (pred_4 obj_31 obj_27)
       (pred_4 obj_31 obj_07)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_05 obj_28)
       (pred_4 obj_19 obj_26)
       (pred_4 obj_19 obj_14)
       (pred_4 obj_19 obj_05)
       (pred_4 obj_26 obj_12)
       (pred_4 obj_26 obj_21)
       (pred_4 obj_26 obj_19)
       (pred_4 obj_12 obj_10)
       (pred_4 obj_12 obj_07)
       (pred_4 obj_12 obj_26)
       (pred_4 obj_10 obj_31)
       (pred_4 obj_10 obj_12)
       (pred_11 obj_19)
       (pred_11 obj_12)
       (pred_11 obj_26)
       (pred_9  obj_19 obj_25)
       (pred_9  obj_12 obj_03)
       (pred_9  obj_26 obj_17)
       (pred_1 obj_11)
       (pred_1 obj_20)
       (pred_1 obj_24)
       (pred_1 obj_01)
       (pred_1 obj_23)
       (pred_1 obj_18)
       (pred_1 obj_13)
       (pred_1 obj_16)
       (pred_1 obj_08)
       (pred_1 obj_30)
       (pred_1 obj_09)
       (pred_1 obj_02)
       (pred_1 obj_15)
       (pred_1 obj_04)
       (pred_1 obj_27)
       (pred_1 obj_28)
       (pred_1 obj_14)
       (pred_1 obj_21)
       (pred_1 obj_07)
       (pred_1 obj_31)
       (pred_1 obj_05)
       (pred_1 obj_10)

       (pred_5  obj_06 obj_25)
       (pred_5  obj_22 obj_03)
       (pred_5  obj_29 obj_17)
       (pred_7 obj_06 obj_20)
       (pred_7 obj_22 obj_23)
       (pred_7 obj_29 obj_05)
       (pred_10 obj_24)
    )

    (:goal (and
       (pred_7 obj_22 obj_28)
    ))
(:constraints
  (always (not (pred_10 obj_01)))
)
)

; plan
1. (op_5 obj_24 obj_16)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_16)
   goals met: 0 of 1
2. (op_5 obj_16 obj_08)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_08)
   goals met: 0 of 1
3. (op_5 obj_08 obj_30)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_30)
   goals met: 0 of 1
4. (op_5 obj_30 obj_23)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_23)
   goals met: 0 of 1
5. (op_2 obj_23 obj_22)
   deleted: (pred_7 obj_22 obj_23) (pred_8)
   added: (pred_6 obj_22)
   goals met: 0 of 1
6. (op_5 obj_23 obj_30)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_30)
   goals met: 0 of 1
7. (op_5 obj_30 obj_08)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_08)
   goals met: 0 of 1
8. (op_5 obj_08 obj_16)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_16)
   goals met: 0 of 1
9. (op_5 obj_16 obj_13)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_13)
   goals met: 0 of 1
10. (op_5 obj_13 obj_18)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_18)
   goals met: 0 of 1
11. (op_5 obj_18 obj_09)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_09)
   goals met: 0 of 1
12. (op_5 obj_09 obj_28)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_28)
   goals met: 0 of 1
13. (op_1 obj_28 obj_22)
   deleted: (pred_6 obj_22)
   added: (pred_8) (pred_7 obj_22 obj_28)
   goals met: 1 of 1
